app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "chatroom_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "mlmldmmd"], ["user_id", 1], ["chatroom_id", 1], ["created_at", 2021-04-06 11:14:52 UTC], ["updated_at", 2021-04-06 11:14:52 UTC]]
---
  def create
    message = Message.new(message_params)
    message.user = current_user
    # binding.pry
    if message.save